<style scoped lang="css" src="assets/css/helpBase.css" scoped></style>
<template>
    <div class="container">
        <help-left></help-left>
        <div class="content-right">
            <prev-page></prev-page>
            <p><span>免责声明</span></p>
            <p>西安盖丫信息技术有限公司（盖丫旅行网）在此特别声明对如下事宜不承担任何法律责任：</p>
            <p>（一）对您使用网站、与本网站相关的任何内容、服务或其他链接至本网站的站点、内容均不作直接、间接、法定、约定的保证。</p>
            <p>（二）无论在任何原因下（包括但不限于疏忽原因），对您或任何人通过使用本网站上的信息或由本网站链接的信息，或其他与本网站链接的网站信息所导致的损失或损害（包括直接、间接、特别或后果性的损失或损害，例如收入或利润之损失，电脑系统之损坏或数据丢失等后果），责任均由使用者自行承担（包括但不限于疏忽责任），盖丫旅行网尊重他人的任何权利（包括知识产权），同时也要求我们的使用者也尊重他人的权利。盖丫旅行网所收集的部分公开资料来源于因特网，因此，对于有损其所有人利益的内容，请及时告之，盖丫旅行网将做出妥善处理。</p>
            <p>若要访问和使用盖丫旅行网站，您必须不加修改地完全接收本协议中所包含的条款、条件和盖丫旅行网即时刊登的通告，并且遵守有关互联网及/或本网站的相关法律、规定与规则。一旦您访问、使用了盖丫旅行网站，即表示您同意并接受了所有该等条款、条件及通告。</p>
        </div>
    </div>
</template>
<script src="assets/js/disclaimer.js"></script>